demo-output/website/campaign/F3_runs/diamond/M2.0_eps7p125/coarse/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       3880;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       3900;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          40;
        startFace       3920;
    }
    top
    {
        type            patch;
        nFaces          100;
        startFace       3960;
    }
    obstacle
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       4060;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4000;
        startFace       4120;
    }
)

// ************************************************************************* //
